## Plan Result (prod_global)




<pre><code>Plan: 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-response-pet&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-response-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-staff-pet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["et-response-pet"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/et-response-pet"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["et-pet"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/etpetprod"
        name                              = "etpetprod"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (6 unchanged attributes hidden)

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "IPMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "86.13.182.74/32",
                  + "151.225.237.115/32",
                  + "109.175.168.211/32",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "IPMatch"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["et-response-pet"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/etresponsepetprod"
        name                              = "etresponsepetprod"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (6 unchanged attributes hidden)

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "IPMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "86.13.182.74/32",
                  + "151.225.237.115/32",
                  + "109.175.168.211/32",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "IPMatch"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["et-staff-pet"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/etstaffpetprod"
        name                              = "etstaffpetprod"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (6 unchanged attributes hidden)

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "IPMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "86.13.182.74/32",
                  + "151.225.237.115/32",
                  + "109.175.168.211/32",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "IPMatch"
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1719,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->